## Ejercicios repaso Pandas

In [ ]:

lst1 = ['gato', 'perro', 'ratón', 'elefante', 'rinoceronte']
lst2 = [x for x in range(1,6)]

In [29]:
#1. Convierte lst1 a un Series y lst2 a otro Series. Una vez creados, combinar los Series para crear un DataFrame
import pandas as pd
import numpy as np
lst1= pd.Series(lst1)
lst2 = pd.Series([x for x in range(1,6)])
series_dt = pd.DataFrame({'list1':lst1, 'list2':lst2})
series_dt

         list1  list2
0         gato      1
1        perro      2
2        ratón      3
3     elefante      4
4  rinoceronte      5

In [32]:
#2. Renombra la Series basada en lst1 creada previamente a "animales"
series_dt.rename(columns={'list1':'animales'})

      animales  list2
0         gato      1
1        perro      2
2        ratón      3
3     elefante      4
4  rinoceronte      5

In [94]:
#3. Crea dos series de tamaño 10 con valores entre 1 y 10. Elimina del series1 los elementos que aparezcan en Series2
import numpy as np
ser1 = pd.Series([1, 2, 3, 4, 5, 7, 4, 5 , 2, 1])
ser2 = pd.Series([3, 4, 5, 6, 7, 2 , 5, 4, 3, 1])

# union of the series
union = pd.Series(np.union1d(ser1, ser2))

# intersection of the series
intersect = pd.Series(np.intersect1d(ser1, ser2))

eliminar_duplicates = intersect.drop
print(eliminar_duplicates)

<bound method Series.drop of 0    1
1    2
2    3
3    4
4    5
5    7
dtype: int64>

In [56]:
#4. Obtén los elementos no comunes en ambas series
# uncommon elements in both the series
not_commons_series = union[~union.isin(intersect)]

# displaying the result
print(not_commons_series)

5    6
dtype: int64

In [64]:
#5. Obtén el mínimo y los percentiles 25, 50, 75 y 80 de la primera serie
print(ser1.min())
print(ser1.quantile(0.25))
print(ser1.quantile(0.5))
print(ser1.quantile(0.75))
print(ser1.quantile(0.80))

1
2.0
3.5
4.75
5.0

In [67]:
#6. Obtén la frecuencia con la que se repite cada valor
print(ser1.value_counts())
print(ser2.value_counts())

1    2
2    2
4    2
5    2
3    1
7    1
dtype: int64
3    2
4    2
5    2
6    1
7    1
2    1
1    1
dtype: int64

In [123]:
#7. Mantén el valor de los dos elementos más repetidos y al resto asignale el valor "Otros"
between_series = pd.DataFrame({'first': ser1,'second': ser2})
between_data = pd.DataFrame(between_series, columns = ['first', 'second'])
#Aqui se realiza el reemplazao de los elementos de cada columna
between_data['first']=between_data['first'].replace([3,7],['Otros', 'Otros'])
between_data['second']=between_data['second'].replace([6,7,2,1],['Otros', 'Otros', 'Otros', 'Otros'])
between_data['second'].replace([6,7,2,1], 'Otros')

print(between_data)

   first second
0      1      3
1      2      4
2  Otros      5
3      4  Otros
4      5  Otros
5  Otros  Otros
6      4      5
7      5      4
8      2      3
9      1  Otros

In [204]:
#8. Crea un Series de tamaño 35 con valores aleatorios. Crea un DataFrame basado en este Series de dimensión 7 filas y 5 columnas

intenso = pd.DataFrame(np.random.randint(0, 1000, (7, 5)),columns=['A', 'B', 'C', 'D', 'F'])
intenso

     A    B    C    D    F
0  700  238  677  171  723
1  856  582  660  902  796
2  627  902  834  604  988
3  614  869  379  709  109
4  329  100  694  845  917
5  507  671  593   35  237
6  243  250  392  766  281

In [210]:
#9. Partiendo de las series creadas en el *Ejercicio 1* apilar las dos series verticalmente.
concatenate = pd.concat([ser1, ser2], axis=0)
concatenate

0    1
1    2
2    3
3    4
4    5
5    7
6    4
7    5
8    2
9    1
0    3
1    4
2    5
3    6
4    7
5    2
6    5
7    4
8    3
9    1
dtype: int64

In [274]:
#10. Ahora apila horizontalmente
horizontal = pd.concat([ser1, ser2], axis=1)
horizontal

   0  1
0  1  3
1  2  4
2  3  5
3  4  6
4  5  7
5  7  2
6  4  5
7  5  4
8  2  3
9  1  1

In [234]:
#11. Cómo convertir en mayúscula el primer caracter de Series de animales
# lst1 = pd.Series(['gato', 'perro', 'ratón', 'elefante', 'rinoceronte'])
new_seriesUpper = lst1.map(lambda x: x[0].upper()+x[1:-1] + x[-1])
new_seriesUpper

0           Gato
1          Perro
2          Ratón
3       Elefante
4    Rinoceronte
dtype: object

In [239]:
#12. Calcula el número de caracteres de cada elemento
characters = lst1.map(lambda calc: len(calc))
characters

0     4
1     5
2     5
3     8
4    11
dtype: int64

In [246]:
#13. Calcula la diferencia entre los valores de cada elemento consecutivo del Series numérico
lst2.std()

1.5811388300841898

In [278]:
#14. Dada la lista siguiente de fechas, carga un Series de string a datetime ['2015-08-06T12:20', '2012-04-02', '2021/01/03', '20191121', '01-12-2015', '04 Jan 2007']

date = ['2015-08-06T12:20', '2012-04-02', '2021/01/03', '20191121', '01-12-2015', '04 Jan 2007']
date2 = pd.to_datetime(date)
date_Series = pd.Series(date2)
print(date_Series)

0   2015-08-06 12:20:00
1   2012-04-02 00:00:00
2   2021-01-03 00:00:00
3   2019-11-21 00:00:00
4   2015-01-12 00:00:00
5   2007-01-04 00:00:00
dtype: datetime64[ns]

In [282]:
dates = pd.Series(pd.to_datetime(['2015-08-06T12:20', '2012-04-02', '2021/01/03', '20191121', '01-12-2015', '04 Jan 2007']))
print(dates)


date = pd.date_range('2018-12-30', '2019-01-07',freq='D').to_series()
date.dt.dayofweek

0   2015-08-06 12:20:00
1   2012-04-02 00:00:00
2   2021-01-03 00:00:00
3   2019-11-21 00:00:00
4   2015-01-12 00:00:00
5   2007-01-04 00:00:00
dtype: datetime64[ns]

2018-12-30    6
2018-12-31    0
2019-01-01    1
2019-01-02    2
2019-01-03    3
2019-01-04    4
2019-01-05    5
2019-01-06    6
2019-01-07    0
Freq: D, dtype: int64

In [279]:
#15. Obtén el día del año del Series anterior

print('Dia:',date2.day)
print('Año:', date2.year)

Dia: Int64Index([6, 2, 3, 21, 12, 4], dtype='int64')
Año: Int64Index([2015, 2012, 2021, 2019, 2015, 2007], dtype='int64')

In [332]:
#16. Obtén el día de la semana
date2.dt.day_of_week

#El numero cero es Lunes, hasta el 6 que es Domingo -- Me ha faltado utilizar  la biblioteca calendar donde haciendolo de la siguiente forma se podria conseguir los nombres de cada dia:
#pongo de ejemplo lo siguiente para que lo puedas comprobar
# from datetime import date
# import calendar
# actual_date = date.today()
# print(calendar.day_name[actual_date.weekday()])

2018-12-30    6
2018-12-31    0
2019-01-01    1
2019-01-02    2
2019-01-03    3
2019-01-04    4
2019-01-05    5
2019-01-06    6
2019-01-07    0
Freq: D, dtype: int64

In [398]:
#17. Crea un DataFrame basado en un Series de 10 elementos que se genere aleatoriamente entre "manzana", "plátano", "zanahoria" y pesos que sea un Series de 10 elementos aleatorios entre 1 y 10. Calcula la media del peso por fruta.

fruits = [np.random.choice(('manzana', 'plátano', 'zanahoria')) for _ in range(10)]
weight = np.random.randint(1,10, size=10)
dataFrame_all = pd.DataFrame({'Fruit': fruits, "Weight":weight})

print(dataFrame_all)
print(dataFrame_all['Fruit'].value_counts())

print(dataFrame_all['Weight'][dataFrame_all['Fruit'] == 'manzana'].mean())
print(dataFrame_all['Weight'][dataFrame_all['Fruit'] == 'plátano'].mean())
print(dataFrame_all['Weight'][dataFrame_all['Fruit'] == 'zanahoria'].mean())

       Fruit  Weight
0    manzana       9
1    plátano       2
2    plátano       1
3  zanahoria       6
4    plátano       1
5  zanahoria       2
6    manzana       5
7  zanahoria       2
8  zanahoria       1
9  zanahoria       4
zanahoria    5
plátano      3
manzana      2
Name: Fruit, dtype: int64
7.0
1.3333333333333333
3.0

In [444]:
#18. Crea un Series que contenga los 10 primeros lunes de 2022 como índice y un número aleatorio como valor

value_aleat = np.random
date_init = pd.Series(np.random.randint(0,100),index=pd.date_range(start='01/01/2022', end='03/07/2022', freq='W-MON'))
date_init

2022-01-03    49
2022-01-10    49
2022-01-17    49
2022-01-24    49
2022-01-31    49
2022-02-07    49
2022-02-14    49
2022-02-21    49
2022-02-28    49
2022-03-07    49
Freq: W-MON, dtype: int64

In [469]:
#19. Crea un DataFrame basado en el Series del *Ejercicio 18* con las columnas llamadas fecha y precio

indexado = pd.DataFrame(date_init)
indexado = indexado.rename_axis('Fecha').reset_index()
indexado.rename({0:'Precio'}, axis=1, inplace=True)
indexado

       Fecha  Precio
0 2022-01-03      49
1 2022-01-10      49
2 2022-01-17      49
3 2022-01-24      49
4 2022-01-31      49
5 2022-02-07      49
6 2022-02-14      49
7 2022-02-21      49
8 2022-02-28      49
9 2022-03-07      49

In [583]:
#20. Genera un DataFrame de 5x5 y posteriormente invierte el orden de los valores de sus filas
array = np.array([[413,78,723,282,363],[767,80,163,564,913],[592,394,188,969,99],[921,639,154,563,335],[125,283,132,358,725]])

five_five = pd.DataFrame(array, columns=['A', 'B', 'C', 'D', 'E'])
print(five_five)

print(five_five.sort_values(by= 'E' ,ascending=False))

     A    B    C    D    E
0  413   78  723  282  363
1  767   80  163  564  913
2  592  394  188  969   99
3  921  639  154  563  335
4  125  283  132  358  725
     A    B    C    D    E
1  767   80  163  564  913
4  125  283  132  358  725
0  413   78  723  282  363
3  921  639  154  563  335
2  592  394  188  969   99

In [587]:
#21. Añade una nueva columna que sea el máximo entre el mínimo de cada fila
five_five['Result'] = five_five.max(axis=1)/five_five.min(axis=1)
print(five_five)

     A    B    C    D    E     Result
0  413   78  723  282  363   9.269231
1  767   80  163  564  913  11.412500
2  592  394  188  969   99   9.787879
3  921  639  154  563  335   5.980519
4  125  283  132  358  725   5.800000